========================================================
simple struct
========================================================

struct AnyStruct {
    a: u256,
    b: u32
}

--------------------------------------------------------

(source_file
    (struct
        (identifier)
        (identifier)
        (primitive_type
            (integer_type))
        (identifier)
        (primitive_type
            (integer_type))))

========================================================
simple enum
========================================================

enum AnyEnum {
    A: felt252,
    B: (usize, u256)
}

--------------------------------------------------------

(source_file
      (enum
        (identifier)
        (identifier)
        (primitive_type)
        (identifier)
        (tuple_expression
          (identifier)
          (primitive_type
            (integer_type)))))

========================================================
simple const
========================================================

const EXAMPLE = 100;

--------------------------------------------------------

(source_file
    (const
        (identifier)
        (literal_expression
            (integer_literal))))


========================================================
typed const
========================================================

const EXAMPLE: u32 = 100;

--------------------------------------------------------

(source_file
    (const
        (identifier)
        (primitive_type
            (integer_type))
        (literal_expression
            (integer_literal))))


